Tekla.Structures.ModelInternal.dotReinforcement_t
Serialization structure for Reinforcement.

Tekla.Structures.ModelInternal.dotReinforcement_t.ModelObject
Base class.

Tekla.Structures.ModelInternal.dotReinforcement_t.Father
The father part of the reinforcement.

Tekla.Structures.ModelInternal.dotReinforcement_t.aSize
The size of the reinforcement.

Tekla.Structures.ModelInternal.dotReinforcement_t.aGrade
The steel grade of the reinforcing bar.

Tekla.Structures.ModelInternal.dotReinforcement_t.aName
Name of the reinforcement.

Tekla.Structures.ModelInternal.dotReinforcement_t.Class
Class of the reinforcement.

Tekla.Structures.ModelInternal.dotReinforcement_t.NumberingSeries
Numbering series of the reinforcement.

Tekla.Structures.ModelInternal.dotReinforcement_t.nOnPlaneOffsetValues
Number of offset values.

Tekla.Structures.ModelInternal.dotReinforcement_t.aOnPlaneOffsets
The offset value for each leg on the same plane as the bar.

Tekla.Structures.ModelInternal.dotReinforcement_t.StartFromPlaneOffset
The start offset value from the part surface.

Tekla.Structures.ModelInternal.dotReinforcement_t.StartPointOffsetType
The type of the start point offset.

Tekla.Structures.ModelInternal.dotReinforcement_t.StartPointOffsetValue
The concrete cover thickness or leg length at the first end of the bar.

Tekla.Structures.ModelInternal.dotReinforcement_t.EndPointOffsetType
The type of the end point offset.

Tekla.Structures.ModelInternal.dotReinforcement_t.EndPointOffsetValue
The concrete cover thickness or leg length at the second end of the bar.

Tekla.Structures.ModelInternal.dotReinforcement_t.nRadiusValues
Number of the radiusvalues.

Tekla.Structures.ModelInternal.dotReinforcement_t.aRadiusValues
The radius value(s) of the bends in the bar.

Tekla.Structures.ModelInternal.dotReinforcement_t.ClientId


Tekla.Structures.ModelInternal.dotReinforcement_t.EndFromPlaneOffset
The end offset value from the part surface.

Tekla.Structures.ModelInternal.dotReinforcement_t.DeformingType
Deforming type of the reinforcement.
Used to define the reinforecment deforming during insert.